---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.PrincipalAxesAngle
source: html/d796e040-5454-5f20-588c-fa55598dd92f.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.PrincipalAxesAngle Property

Rotation angle between the principal axes and cross section reference planes.

## Syntax (C#)
```csharp
public double PrincipalAxesAngle { get; set; }
```